package com.example.iso8583.enums


/**
 * 业务交易类型
 * 使用枚举实现与多对象存储不同业务，由于这些业务对象是长时间存在的，因为选择枚举简化这个业务流程。
 *
 * @param typeDes     交易类型描述
 * @param mti         消息类型标识符
 * @param fields      报文组所需域的集合-必填,可选
 * @param f3          3域
 * @param f25         25域
 * @param isDb        是否生成交易记录
 * @param isReverse   是否支持冲正
 * @param isLoading   是否显示进度圈
 * @param isAddTransCount   交易最大笔数是否增加
 */
enum class PaymentParams(
    val typeDes: String, val mti: String, val fields: Array<String>, val f3: String,
    var f25: String, var isDb: Boolean, val isReverse: Boolean, val isLoading: Boolean, val isAddTransCount: Boolean,
) {

    /**
     * 签到
     */
    SINGON(
        "签到",
        "0800",
        arrayOf("3", "11", "24", "41", "42", "60"),
        "920000",
        "",
        false,
        false,
        false,
        false
    ),

    /**
     * 签退
     */
    SINGOFF(
        "签退",
        "0820",
        arrayOf("3", "11", "24", "41", "42", "60"),
        "920000",
        "",
        false,
        false,
        true,
        false
    ),

    /**
     * 有卡支付
     */
    YK_SALE(
        "消费",
        "0200",
        arrayOf("2", "3", "4", "11", "12", "13", "14", "22", "23", "24", "25", "26", "35", "41", "42", "45", "48", "49", "52", "54", "55", "59", "60", "61", "62"),
        "000000",
        "00",
        true,
        true,
        true,
        true
    ),

    /**
     * 交易认证
     */
    TRANSACTION_CERTIFICATE_UPLOAD(
        "交易认证",
        "0320",
        arrayOf("2", "3", "4", "11", "12", "13", "14", "22", "23", "24", "25", "37", "38", "39", "41", "42", "49", "54", "55", "59", "60", "62"),
        "940000",
        "00",
        false,
        false,
        false,
        false
    ),

    /**
     * 离线交易
     */
    OFFLINE(
        "离线消费",
        "0220",
        arrayOf("2", "3", "4", "11", "12", "13", "14", "22", "23", "24", "25", "26", "35", "38", "41", "42", "45", "48", "49", "52", "54", "59", "60", "62"),
        "000000",
        "00",
        true,
        true,
        true,
        true
    ),

    /**
     * 有卡分期支付
     */
    IPP(
        "分期消费",
        "0200",
        arrayOf("2", "3", "4", "11", "12", "13", "14", "22", "23", "24", "25", "26", "35", "41", "42", "45", "48", "49", "52", "54", "55", "59", "60", "62", "63"),
        "000000",
        "00",
        true,
        true,
        true,
        true
    ),

    /**
     * 小费调整 不支持冲正，
     *
     */
    TIP_ADJUST(
        "小费调整",
        "0220",
        arrayOf("2", "3", "4", "14", "11", "12", "13", "14", "22", "23", "24", "25", "26", "35", "37", "38", "39", "41", "42", "45", "48", "49", "52", "54", "59", "60", "62"),
        "020000",
        "00",
        true,
        false,
        true,
        true
    ),

    /**
     * 退款
     */
    REFUND(
        "退款",
        "0200",
        arrayOf("2", "3", "4", "11", "12", "13", "14", "22", "23", "24", "25", "26", "35", "37", "41", "42", "45", "48", "49", "52", "59", "60", "61", "62", "63"),
        "200000",
        "00",
        true,
        true,
        true,
        true
    ),

    /**
     * 撤销
     */
    VOID(
        "撤销",
        "0200",
        arrayOf("2", "3", "4", "11", "12", "13", "14", "22", "23", "24", "25", "26", "35", "37", "41", "42", "45", "48", "49", "52", "59", "60", "61", "62"),
        "020000",
        "00",
        true,
        true,
        true,
        true
    ),

    /**
     * 消费冲正
     * POS终端收到POS中心的冲正应答后，如果应答码为“00”、“25”以及“12”，则认为冲正成功，不再重复上送冲正交易。
     */
    YK_REVERSE(
        "冲正",
        "0400",
        arrayOf("2", "3", "4", "11", "12", "13", "14", "22", "23", "24", "25", "26", "35", "39", "41", "42", "45", "48", "49", "52", "55", "59", "60", "61", "62"),
        "",//根据原交易3域一样
        "00",
        false,
        false,
        false,
        false
    ),

    /**
     * 预授权
     */
    PRE_AUTH(
        "预授权",
        "0100",
        arrayOf("2", "3", "4", "11", "12", "13", "14", "22", "23", "24", "25", "26", "35", "41", "42", "45", "48", "49", "52", "54", "55", "59", "60", "62"),
        "300000",
        "00",
        true,
        true,
        true,
        true
    ),

    /**
     * 预授权撤销
     */
    AUTH_REVOCATION(
        "预授权撤销",
        "0120",
        arrayOf("2", "3", "4", "11", "12", "13", "14", "22", "23", "24", "25", "35", "26", "37", "41", "42", "45", "48", "49", "52", "59", "60", "62"),
        "020000",
        "00",
        true,
        true,
        true,
        true
    ),

    /**
     * 预授权完成离线
     */
    AUTH_COMPLETE_OFFLINE(
        "预授权完成离线",
        "0220",
        arrayOf("2", "3", "4", "11", "12", "13", "14", "22", "23", "24", "25", "35", "26", "37", "38", "39", "41", "42", "45", "48", "49", "52", "54", "59", "60", "62"),
        "000000",
        "06",
        true,
        true,
        true,
        true
    ),

    /**
     * 无卡交易类型状态列表查询
     */
    WK_TYPE_LIST(
        "无卡列表",
        "0780",
        arrayOf("3", "41", "42", "48", "60"),
        "000000",
        "67",
        false,
        false,
        true,
        false
    ),

    /**
     * 无卡支付
     * f3: 010000-->pos被扫 c扫b(生成二维码)
     *     000000-->pos主扫 b扫c
     */
    WK_SALE(
        "无卡交易",
        "0700",
        arrayOf("3", "4", "11", "12", "13", "24", "25", "41", "42", "48", "49", "54", "59", "60", "61", "62"),
        "000000",
        "67",
        true,
        false,
        false,
        true
    ),

    /**
     * 无卡支付-查询
     */
    WK_QUERY(
        "无卡交易查询",
        "0700",
        arrayOf("3", "4", "11", "12", "13", "24", "25", "37", "41", "42", "49", "59", "60", "62"),
        "310000",
        "67",
        false,
        false,
        false,
        false
    ),

    /**
     * 签名上传
     */
    UPLOAD_SIGN(
        "签名上传",
        "0920",
        arrayOf("3", "4", "11", "37", "41", "42", "48", "60", "62"),
        "801003",
        "",
        false,
        false,
        true,
        false
    ),

    /**
     * 开始结算
     */
    SETTLEMENT_REQUEST(
        "结算请求",
        "0500",
        arrayOf("3", "11", "12", "13", "24", "41", "42", "60", "63"),
        "920000",
        "00",
        false,
        false,
        false,
        false
    ),

    /**
     * 批次上送
     */
    BATCH_UPLOAD(
        "批上送",
        "0320",
        arrayOf("2", "3", "4", "11", "12", "13", "14", "22", "23", "24", "25", "37", "38", "41", "42", "48", "49", "54", "59", "60", "62", "63"),
        "", //跟原交易走
        "00",
        false,
        false,
        false,
        false
    ),

    /**
     * 结算完成
     */
    SETTLEMENT_COMPLETION(
        "结算完成",
        "0500",
        arrayOf("3", "11", "12", "13", "24", "41", "42", "60", "63"),
        "960000",
        "00",
        false,
        false,
        false,
        false
    ),

    /**
     * pinKey下载
     */
    DOWNLOAD_PIN_KEY(
        "PIN KEY",
        "0800",
        arrayOf("3", "11", "24", "41", "42", "60", "62"),
        "910000",
        "",
        false,
        false,
        false,
        false
    ),

    RSA_KEY_DOWNLOAD(
        "RSA KEY",
        "0800",
        arrayOf("3", "11", "12", "13", "24", "41", "42"),
        "710000",
        "",
        false,
        false,
        false,
        false
    ),

    TMK_DOWNLOAD(
        "TMK",
        "0800",
        arrayOf("3", "11", "12", "13", "24", "41", "42", "62"),
        "810000",
        "",
        false,
        false,
        false,
        false
    ),

    ;
}